// pages/article/article.js
var article_qinzhou = '<p>钦州&mdash;&mdash;三娘湾海豚塑像<br /> <br /> <br /> 钦州三娘湾是广西十佳景区之一，位于广西壮族自治区钦州市犀牛脚镇南海北部湾沿岸。南邻北部湾，背靠乌雷山，掩映在枝繁叶茂的红树林里的海滩洁白柔软，站在如天外流星坠落海滩的三婆石上，朝可观旭日东升，晚可赏夕阳日落斜照，还可拜乌雷伏波庙、游威德寺、观东汉大将风采。更美妙的是，登上渔船出海观光，可以捕捉海鱼，吹吹海风，还能够看看珍奇的中华白海豚。</p>    <p>& nbsp; </p>        < p > 关于三娘湾的由来，还有个关于 & ldquo; 三娘湾之恋 & rdquo; 美丽的传说 & mdash;& mdash; </p>            < p > <br /> 很久以前，那个时候的三娘湾还不叫三娘湾，人烟也非常稀少。那片海域只有苏、杨、李姓三个男青年，他们共同生活一条渔船上，共用一网同住一舱，日子过得艰苦又窘困。但是三个青年非常勤劳，每天天没亮就开始起床出海打渔，所到之处歌声欢声不断，天黑才收网休息，每天都是满载而归，三个人就这样欢喜地过着日子。随着时间流逝，三个青年越来越像一家人，可整个海域只有他们三个男人，没有办法组成一个完整的家庭。就这样，三个男青年怀着这份淡淡的忧伤依旧每天早出晚归地过着打渔的生活。忽然在一个阳光明媚的日子，三个仙女偶落凡尘，发现这独特的海湾和三位勤劳英俊的小伙子，三位仙女依然决定下嫁人间。玉帝知道之后也不好棒打鸳鸯，和女儿们约定三年为期，时间一到就要回到天上，否则将受惩罚。六人一齐答应了玉帝，从此过起了幸福美好的生活。白天丈夫出海打鱼，妻子在家织网。夫妻恩爱，生活美满。三年时间一晃而过，玉帝见仙女未归，就派天兵天将去催促她们三个，然而并没有什么用，这三对夫妇难分难舍，仙女们已经不想回归天庭。玉帝震怒之下，趁着三个男青年出海打渔的时候，故意掀起狂风恶浪，吞没渔船。三位娘子在海边并排站着，顶着狂风恶浪，等候丈夫归来，后来得知丈夫遇难，她们三个更不愿意回天庭，于是化身成为三个花岗岩石，并排站在沙滩上，即如今的&ldquo;三婆石&rdquo;，三娘湾之名也因此而来。大海见证了他们坚贞的爱情、勤劳勇敢的象征，也正是因为这三块不寻常的石头，越来越多的人们来到三娘湾，并在这里定居过起了安定的生活。</p >            <p>三娘湾的居民饮食偏清淡，菜系偏向于粤菜。由于靠海，海鲜种类很多，海鱼，海葵，海鸭蛋，青蟹等美味有名。<br /> </p >'
Page({

  /**
   * 页面的初始数据
   */
  data: {
      article: article_qinzhou,
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})